uhnp/src/Catalogs/тн_ИДБазРеспондентов/тн_ИДБазРеспондентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>тн_ИДБазРеспондентов</name>
  <comment>Выполнение задач №000042800</comment>
  <predefined>
    <items>
      <name>ЦБ</name>
      <description>ЦБ</description>
    </items>
  </predefined>
  <attributes>
    <name>systemSender</name>
    <comment>ИД базы в сообщениях обмена</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БалансоваяЕдиница</name>
    <comment>Выполнение задач №000044027</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВызыватьПроведениеСПроверкойЗаполненностиРеквизитов</name>
    <comment>Выполнение задач №000046776</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапретыНаЗагрузку</name>
    <comment>Выполнение задач №000048764</comment>
    <attributes>
      <name>ВидСообщения</name>
      <type>
        <types>EnumRef.тн_ВидыСообщений_ERP_УХ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтруктураКомпании</name>
    <comment>№000050333</comment>
    <attributes>
      <name>Организация</name>
      <comment>№000050333</comment>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазрешенныеОрганизации</name>
    <comment>//Сафиуллина З.Р. 25.09.2025 Выполнение задач №000055082</comment>
    <attributes>
      <name>ВидСообщения</name>
      <type>
        <types>EnumRef.тн_ВидыСообщений_ERP_УХ</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/тн_ИДБазРеспондентов/Forms/ФормаЭлемента/Module.bsl
//Сафиуллина З.Р. 25.09.2025 Выполнение задач №000055082
#Область ОбработчикиСобытийФормы

//Сафиуллина З.Р. 25.09.2025 Выполнение задач №000055082
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаголовокРазрешенныхОрганизацийПоУмолчанию = Элементы.РазрешенныеОрганизации.Заголовок; 
	
КонецПроцедуры //ПриСозданииНаСервере()

//Сафиуллина З.Р. 25.09.2025 Выполнение задач №000055082
#КонецОбласти 

//Сафиуллина З.Р. 25.09.2025 Выполнение задач №000055082
#Область ОбработчикиСобытийЭлементовТаблицыЗапретыНаЗагрузку

//Сафиуллина З.Р. 25.09.2025 Выполнение задач №000055082
//
&НаКлиенте
Процедура ЗапретыНаЗагрузкуПриАктивизацииСтроки(Элемент)
    
    ВыделенныеСтроки = Элементы.ЗапретыНаЗагрузку.ВыделенныеСтроки;
    ТекущиеДанныеЗапрета = Элементы.ЗапретыНаЗагрузку.ТекущиеДанные;   

	Если ВыделенныеСтроки.Количество() <> 1 
		ИЛИ ТекущиеДанныеЗапрета = Неопределено Тогда
		Элементы.РазрешенныеОрганизации.ОтборСтрок = Неопределено;
		Элементы.РазрешенныеОрганизации.Заголовок = ЗаголовокРазрешенныхОрганизацийПоУмолчанию;
        Возврат;
    КонецЕсли;
	
	УстановитьОтборПоВидуСообщения(ТекущиеДанныеЗапрета);
    
КонецПроцедуры //ЗапретыНаЗагрузкуПриАктивизацииСтроки()

//Сафиуллина З.Р. 25.09.2025 Выполнение задач №000055082
//
&НаКлиенте
Процедура ЗапретыНаЗагрузкуПередУдалением(Элемент, Отказ) 
	
	УдаляемаяСтрока = Элемент.ТекущиеДанные;
    Если УдаляемаяСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ВидСообщенияДляУдаления = УдаляемаяСтрока.ВидСообщения;
    
    ПараметрыПоиска = Новый Структура("ВидСообщения", ВидСообщенияДляУдаления);
    НайденныеСтроки = Объект.РазрешенныеОрганизации.НайтиСтроки(ПараметрыПоиска);
    
    Для Каждого СтрокаКУдалению Из НайденныеСтроки Цикл
        Объект.РазрешенныеОрганизации.Удалить(СтрокаКУдалению);
	КонецЦикла; 
	
КонецПроцедуры  //ЗапретыНаЗагрузкуПередУдалением()

//Сафиуллина З.Р. 25.09.2025 Выполнение задач №000055082
#КонецОбласти

//Сафиуллина З.Р. 25.09.2025 Выполнение задач №000055082
#Область ОбработчикиСобытийЭлементовТаблицыРазрешенныеОрганизации 

//Сафиуллина З.Р. 25.09.2025 Выполнение задач №000055082
//
&НаКлиенте
Процедура РазрешенныеОрганизацииПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если Не НоваяСтрока Тогда
        Возврат;
    КонецЕсли;
    
    ТекущаяСтрокаЗапрета = Элементы.ЗапретыНаЗагрузку.ТекущиеДанные;
    
    Если ТекущаяСтрокаЗапрета = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Элемент.ТекущиеДанные.ВидСообщения = ТекущаяСтрокаЗапрета.ВидСообщения; 
	УстановитьОтборПоВидуСообщения(ТекущаяСтрокаЗапрета);
	
КонецПроцедуры //РазрешенныеОрганизацииПриНачалеРедактирования()

//Сафиуллина З.Р. 25.09.2025 Выполнение задач №000055082
#КонецОбласти

//Сафиуллина З.Р. 25.09.2025 Выполнение задач №000055082
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
//Сафиуллина З.Р. 25.09.2025 Выполнение задач №000055082
//
Процедура УстановитьОтборПоВидуСообщения(ТекущиеДанныеЗапрета)
	
	ЗначениеОтбора = ТекущиеДанныеЗапрета.ВидСообщения;
	Элементы.РазрешенныеОрганизации.ОтборСтрок = Новый ФиксированнаяСтруктура("ВидСообщения", ЗначениеОтбора);
	Элементы.РазрешенныеОрганизации.Заголовок = ЗаголовокРазрешенныхОрганизацийПоУмолчанию + " по виду сообщения """ + ЗначениеОтбора + """";

КонецПроцедуры //УстановитьОтборПоВидуСообщения()

//Сафиуллина З.Р. 25.09.2025 Выполнение задач №000055082
#КонецОбласти
